backend/app/controllers/api/v1/friends_controller.rb

INSERT INTO "friends" ("name", "phone", "email", "recurrence_unit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["phone", ""], ["email", ""], ["recurrence_unit", ""], ["created_at", "2020-07-08 05:23:49.097937"], ["updated_at", "2020-07-08 05:23:49.097937"]]
---
    def create
      @friend = Friend.create(friend_params)